# IDuplicateTypeNamesHandler Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IDuplicateTypeNamesHandler Methods
IDuplicateTypeNamesHandler Interface See Also
---
The IDuplicateTypeNamesHandler type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| OnDuplicateTypeNamesFound | Called when the destination document contains types with the same names as the types being copied. |

# See Also
IDuplicateTypeNamesHandler Interface
Autodesk.Revit.DB Namespace